{
  "metadata": {
    "title": "利用規約 | オニオンノート",
    "description": "オニオンノート（プライバシー優先のノート共有サービス）の利用規約"
  },
  "title": "利用規約",
  "lastModified": "最終更新日: 2025-06-14",
  "sections": {
    "serviceDescription": {
      "title": "1. サービス説明",
      "content": "オニオンノートは、インターネット上でユニークな一回限りのHTTPS URL（以下、リンクと呼ぶ）として暗号化されたノートを共有できる無料のウェブベースサービスです。このリンクは、デフォルトで任意のウェブブラウザからの最初のアクセス後に期限切れになります。"
    },
    "userResponsibilities": {
      "title": "2. ユーザーの責任",
      "content": "ユーザーは以下について単独で責任を負います：",
      "list": [
        "ノートリンクとパスワードの機密性を維持すること",
        "ノートリンクを共有するための適切な通信チャネルを選択すること",
        "ノートの内容および適用法への準拠を確認すること",
        "ノートリンクの紛失または不正アクセスによる結果"
      ]
    },
    "disclaimerOfWarranties": {
      "title": "3. 保証の免責",
      "content": [
        "オニオンノートおよびその運営者は、明示的または黙示的な保証を一切行わず、商品性、特定目的への適合性、または知的財産権の非侵害もしくはその他の権利侵害を含む、制限なしに、黙示的な保証または条件を否認および否定します。",
        "オニオンノートまたはその運営者は、オニオンノートまたは承認された代表者が口頭または書面でそのような損害の可能性について通知されていた場合でも、オニオンノートのウェブサイトまたはサービスの資料の使用または使用不能から生じる損害（データまたは利益の損失、または事業中断による損害を含むがこれに限定されない）について責任を負いません。"
      ]
    },
    "limitationOfLiability": {
      "title": "4. 責任の制限",
      "content": "オニオンノートは、以下に起因する利益、営業権、使用、データ、またはその他の無形の損失を含むがこれに限定されない、直接的、間接的、偶発的、特別、結果的、または例示的な損害について責任を負いません：",
      "list": [
        "サービスの使用または使用不能",
        "ノートへの不正アクセスまたは改変",
        "サービスに関連するその他の事項"
      ]
    },
    "serviceModifications": {
      "title": "5. サービス変更",
      "content": "オニオンノートは、通知の有無にかかわらず、一時的または永続的にサービスを変更または中止する権利を留保します。当社は、サービスの変更、一時停止、または中止について、お客様または第三者に対して責任を負いません。"
    },
    "prohibitedUses": {
      "title": "6. 禁止された使用",
      "content": "ユーザーは以下の目的でサービスを使用することを禁止されています：",
      "list": [
        "違法、有害、脅迫的、虐待的、嫌がらせ、中傷的、またはプライバシーを侵害する資料の送信",
        "人物または団体になりすます、または人物または団体との関係を偽って述べる、またはその他の方法で不正に表現すること",
        "サービスまたはサービスに接続されたサーバーまたはネットワークを妨害または中断すること",
        "サービスの任意の部分またはサービスに接続されたその他のシステムまたはネットワークへの不正アクセスを試みること"
      ]
    },
    "useOfCookies": {
      "title": "7. クッキーの使用",
      "content": "現在、オニオンノートはクッキーを使用していません。将来的にクッキーの使用を実装する場合、このポリシーを更新し、変更をユーザーに通知します。"
    },
    "governingLaw": {
      "title": "8. 準拠法",
      "content": "これらの規約は、法の抵触規定に関係なく、日本の法律に従って管轄され、解釈されます。これらの規約の下でまたはこれに関連して発生する紛争は、日本の裁判所の専属管轄権に服します。"
    },
    "changesToTerms": {
      "title": "9. 規約の変更",
      "content": "オニオンノートは、いつでもこれらの規約を変更する権利を留保します。重要な変更については、このページに新しい規約を掲載することで、ユーザーに通知します。そのような変更後のサービスの継続使用は、変更された規約の承認を構成します。"
    }
  }
}
