{
  "metadata": {
    "title": "プライバシーポリシー | オニオンノート",
    "description": "オニオンノート（プライバシー優先のノート共有サービス）のプライバシーポリシー"
  },
  "title": "プライバシーポリシー",
  "lastModified": "最終更新日: 2025-06-14",
  "sections": {
    "introduction": {
      "title": "はじめに",
      "content": "オニオンノートでは、サイトの主な目的がプライバシーの保護であるため、プライバシーを非常に重要視しています。このポリシーでは、オニオンノートがユーザーのプライバシーを保護するために講じている措置について概説しています。"
    },
    "serviceDescription": {
      "title": "1. サービス説明",
      "content": [
        "オニオンノートは、インターネット上でユニークな一回限りのHTTPS URL（以下、リンクと呼ぶ）として暗号化されたノートを共有できる無料のウェブベースサービスです。このリンクは、デフォルトで任意のウェブブラウザからの最初のアクセス後に期限切れになります。",
        "オニオンノートはリンクを送信する手段を提供していないため、リンクの送信行為はオニオンノートユーザーの全責任となります。",
        "選択した通信チャネル（例：電子メール、ファックス、SMS、電話、インスタントメッセージング、ソーシャルメディア）によっては、第三者があなたの通信を傍受し、伝達されたリンクを知ることで、あなたのノートを読むことができる可能性があります。"
      ]
    },
    "noteProcessing": {
      "title": "2. ノートとその内容の処理方法",
      "content": [
        "リンクはユーザーのブラウザで生成され、そのままオニオンノートに送信されることはありません。リンクは送信者（および後に受信者）の手の中にのみあります。したがって、オニオンノートユーザーがリンクを失った場合、ノートを回復する方法はありません。",
        "リンクのみが復号化キーをノートの内容に結び付けており、オニオンノートがリンクを持っていないため、オニオンノートで読み取り可能な形式でノートが保持されることはありません。これにより、誰も（オニオンノートの管理者を含む）ノートを読むことができません。",
        "オニオンノートのデフォルト機能を使用する場合、ノートが取得されると、そのデータはオニオンノートから完全に削除され、再び回復する方法は全くありません。",
        "ノートが30日後に取得されない場合、オニオンノートは読まれたかのように永続的に削除します。"
      ]
    },
    "ipAddressProcessing": {
      "title": "3. IPアドレスの処理",
      "content": "オニオンノートは、レート制限の目的およびオニオンノートのサーバーとの通信を可能にするためにのみIPアドレスを処理します。IPアドレスはログに記録されず、通信の目的で不要になり次第削除されます。"
    },
    "pseudonymousData": {
      "title": "4. 仮名データ",
      "content": [
        "ノートの作成者は、ノートに個人データを導入することができます。このデータは暗号化されていても、再び復号化することができるため、仮名（個人）データを構成します。いずれにしても、オニオンノートはIPアドレスを保存しないため、オニオンノートのデータベースからノートの作成者を推測することはできません。",
        "ノートデータの復号化はユーザー（送信者と受信者）の手にあります。オニオンノートは、リンクにのみ含まれる復号化キーを所有していないため、ノートを復号化し、作成者によって導入されたデータ（個人的なものまたはその他のもの）にアクセスすることはできません。"
      ]
    },
    "disclaimer": {
      "title": "5. 免責事項",
      "content": "人がオニオンノートのリンクをクリックした場合、オニオンノートはノートの内容に関連するいかなる責任も負いません。"
    },
    "dataDisclosure": {
      "title": "6. 第三者へのデータ開示",
      "content": "オニオンノートは、他者と情報を共有したり販売したりしません。また、このプライバシーポリシーに記載されていない方法で情報を使用することもありません。"
    },
    "cookies": {
      "title": "7. クッキー",
      "content": "現在、オニオンノートはトラッキング、分析、またはパーソナライゼーションのためにクッキーやローカルストレージを使用していません。将来的に（例えば、言語設定を記憶したり、サービスの使いやすさを向上させるために）クッキーを実装することを決定した場合、事前にこのプライバシーポリシーを更新し、適用法で要求される場合はユーザーから明示的な同意を要求します。"
    },
    "children": {
      "title": "8. 児童",
      "content": "オニオンノートは16歳未満の児童を対象とせず、引き付けることを意図していません。未成年者は、オニオンノートにアクセスまたは使用する前に、両親または法的保護者から明示的な同意を得る必要があります。"
    },
    "policyValidity": {
      "title": "9. このプライバシーポリシーの有効性",
      "content": "このプライバシーポリシーは随時変更される可能性があることをご注意ください。ほとんどの変更は軽微なものと予想されます。それでも、ポリシーの変更をこのページに投稿し、変更が重要である場合は、ホームページのメッセージなど、より目立つ通知を提供します。このポリシーの各バージョンは、有効日によってページの上部で識別されます。"
    }
  }
}
